#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.genericRG: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG]
azurerm_virtual_network.genericVNet2: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main2]
azurerm_network_security_group.rdpNSG: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkSecurityGroups/DemoRDPSG]
azurerm_virtual_network.genericVNet: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main]
azurerm_network_security_group.sshNSG: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG/providers/Microsoft.Network/networkSecurityGroups/DemoSSHSG]
azurerm_subnet.main: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main/subnets/demo-dev-main]
azurerm_subnet.app: Refreshing state... [id=/subscriptions/37e4077a-2e95-49e4-b443-5f5ce8f92657/resourceGroups/DemogenericRG/providers/Microsoft.Network/virtualNetworks/Demo-Main/subnets/demo-dev-app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_virtual_network.genericVNet2 will be created
  + resource "azurerm_virtual_network" "genericVNet2" {
      + address_space       = [
          + "10.70.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus2"
      + name                = "Demo-Main2"
      + resource_group_name = "DemogenericRG"
      + subnet              = [
          + {
              + address_prefix = "10.70.0.0/28"
              + id             = (known after apply)
              + name           = "subnet1"
              + security_group = ""
            },
          + {
              + address_prefix = "10.70.0.16/28"
              + id             = (known after apply)
              + name           = "subnet2"
              + security_group = ""
            },
        ]
      + tags                = {
          + "BillingCode" = "Internal"
          + "Customer"    = "Demo"
          + "Environment" = "Development"
          + "POC"         = "Marcelo Zambrana"
          + "Project"     = "Demo IC"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>

*Pusher: @Chambras, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*